podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_32CH_TRIG_SPLIT_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
-->
      <peripheral>
         <?sourceFile "DMAMUX0_32CH_TRIG_SPLIT_MK28F15" ?>
         <name>DMAMUX0</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>32</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
               <name>CHCFG%s</name>
               <?hide?>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>CHCFG_0_15%s</name>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable</description>
                           <value>0b000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reserved</description>
                           <value>0b000001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>LPUART0_Rx</description>
                           <value>0b000010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>LPUART0_Tx</description>
                           <value>0b000011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>LPUART1_Rx</description>
                           <value>0b000100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>LPUART1_Tx</description>
                           <value>0b000101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>LPUART2_Rx</description>
                           <value>0b000110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>LPUART2_Tx</description>
                           <value>0b000111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8</name>
                           <description>LPUART3_Rx</description>
                           <value>0b001000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9</name>
                           <description>LPUART3_Tx</description>
                           <value>0b001001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>LPUART4_Rx</description>
                           <value>0b001010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>LPUART4_Tx</description>
                           <value>0b001011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12</name>
                           <description>I2S0_Rx</description>
                           <value>0b001100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>13</name>
                           <description>I2S0_Tx</description>
                           <value>0b001101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>14</name>
                           <description>SPI0_Rx</description>
                           <value>0b001110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15</name>
                           <description>SPI0_Tx</description>
                           <value>0b001111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>SPI1_Rx</description>
                           <value>0b010000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>17</name>
                           <description>SPI1_Tx</description>
                           <value>0b010001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>18</name>
                           <description>I2C0_I2C3</description>
                           <value>0b010010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>19</name>
                           <description>I2C1_I2C2</description>
                           <value>0b010011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>20</name>
                           <description>FTM0_Channel0</description>
                           <value>0b010100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>21</name>
                           <description>FTM0_Channel1</description>
                           <value>0b010101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>22</name>
                           <description>FTM0_Channel2</description>
                           <value>0b010110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>23</name>
                           <description>FTM0_Channel3</description>
                           <value>0b010111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>24</name>
                           <description>FTM0_Channel4</description>
                           <value>0b011000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>25</name>
                           <description>FTM0_Channel5</description>
                           <value>0b011001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>26</name>
                           <description>FTM0_Channel6</description>
                           <value>0b011010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>27</name>
                           <description>FTM0_Channel7</description>
                           <value>0b011011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>28</name>
                           <description>FTM1_Channel0</description>
                           <value>0b011100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>29</name>
                           <description>FTM1_Channel1</description>
                           <value>0b011101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>30</name>
                           <description>FTM2_Channel0</description>
                           <value>0b011110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>31</name>
                           <description>FTM2_Channel1</description>
                           <value>0b011111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32</name>
                           <description>FTM3_Channel0</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>33</name>
                           <description>FTM3_Channel1</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>34</name>
                           <description>FTM3_Channel2</description>
                           <value>0b100010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>35</name>
                           <description>FTM3_Channel3</description>
                           <value>0b100011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>36</name>
                           <description>FTM3_Channel4</description>
                           <value>0b100100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>37</name>
                           <description>FTM3_Channel5</description>
                           <value>0b100101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>38</name>
                           <description>FTM3_Channel6</description>
                           <value>0b100110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>39</name>
                           <description>FTM3_Channel7</description>
                           <value>0b100111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>40</name>
                           <description>ADC0</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>41</name>
                           <description>Reserved</description>
                           <value>0b101001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>42</name>
                           <description>CMP0</description>
                           <value>0b101010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>43</name>
                           <description>CMP1</description>
                           <value>0b101011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>44</name>
                           <description>Reserved</description>
                           <value>0b101100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>45</name>
                           <description>DAC0</description>
                           <value>0b101101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>46</name>
                           <description>Reserved</description>
                           <value>0b101110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>47</name>
                           <description>CMT</description>
                           <value>0b101111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>48</name>
                           <description>PDB</description>
                           <value>0b110000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>49</name>
                           <description>PortA</description>
                           <value>0b110001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>50</name>
                           <description>PortB</description>
                           <value>0b110010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>51</name>
                           <description>PortC</description>
                           <value>0b110011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>52</name>
                           <description>PortD</description>
                           <value>0b110100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>53</name>
                           <description>PortE</description>
                           <value>0b110101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>54</name>
                           <description>Reserved</description>
                           <value>0b110110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>55</name>
                           <description>Reserved</description>
                           <value>0b110111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>56</name>
                           <description>Reserved</description>
                           <value>0b111000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>57</name>
                           <description>Reserved</description>
                           <value>0b111001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>58</name>
                           <description>SPI2_Rx</description>
                           <value>0b111010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>59</name>
                           <description>SPI2_Tx</description>
                           <value>0b111011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>60</name>
                           <description>AlwaysOn60</description>
                           <value>0b111100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>61</name>
                           <description>AlwaysOn61</description>
                           <value>0b111101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>62</name>
                           <description>AlwaysOn62</description>
                           <value>0b111110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>63</name>
                           <description>AlwaysOn63</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directed routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
